# Lab 3: 802.1X Network Access Control with RADIUS

## üéØ Objective
Implement port-based network access control using 802.1X authentication with a RADIUS server to enforce "who can connect" policies before granting network access. Only authenticated devices/users can access the network.

**Real-World Scenario:** Company requires all devices to authenticate before accessing the corporate network. Guest devices are automatically placed in a restricted Guest VLAN, while employee devices get full network access after AD/RADIUS authentication.

## üîß Equipment Used
- 1 Cisco Switch (SW1) - 2960 with 802.1X support
- 1 RADIUS Server (Windows/Linux server or Packet Tracer server)
- 1 Router (Gateway)
- 3 PCs (Employee PC, Guest PC, Unauthorized PC)
- Software: Cisco Packet Tracer 8.2+

## üìã Network Design

### Network Topology
```
                    [Gateway Router]
                           |
                      [SW1 - Core Switch]
                           |
        ___________________|___________________
       |                   |                   |
   [Fa0/1]             [Fa0/2]             [Fa0/3]
   Employee PC         Guest PC            Unauthorized PC
   (Authenticated)     (Guest Access)      (Blocked)
   
   [Fa0/24] --- RADIUS Server (AAA Authentication)
```

### IP Addressing Scheme

| Device | Interface/VLAN | IP Address | Purpose |
|--------|---------------|------------|---------|
| Router | Gig0/0 | 10.1.1.1/24 | Gateway for all VLANs |
| Router | Gig0/0.10 | 10.1.10.1/24 | Corporate VLAN gateway |
| Router | Gig0/0.20 | 10.1.20.1/24 | Guest VLAN gateway |
| Router | Gig0/0.99 | 10.1.99.1/24 | Management VLAN gateway |
| SW1 | VLAN 99 | 10.1.99.10/24 | Switch management |
| RADIUS Server | NIC | 10.1.99.50/24 | Authentication server |
| Employee PC | NIC | 10.1.10.10/24 | Corporate user (DHCP) |
| Guest PC | NIC | 10.1.20.10/24 | Guest user (DHCP) |

### VLAN Design

| VLAN | Name | Network | Purpose |
|------|------|---------|---------|
| 10 | Corporate | 10.1.10.0/24 | Authenticated employees - full access |
| 20 | Guest | 10.1.20.0/24 | Unauthenticated users - internet only |
| 99 | Management | 10.1.99.0/24 | Network management - RADIUS, switches |

### Authentication Flow
```
1. PC connects to switch port
2. Switch blocks all traffic except EAPOL (authentication)
3. PC sends credentials (username/password or certificate)
4. Switch forwards credentials to RADIUS server
5. RADIUS checks credentials against database
6. If valid: RADIUS sends VLAN assignment (VLAN 10 - Corporate)
7. If invalid/guest: Switch places in Guest VLAN (VLAN 20)
8. Switch allows network access
```

---

## ‚öôÔ∏è Configuration Steps

### PHASE 1: BASIC NETWORK SETUP

#### Step 1: Configure VLANs on Switch
```cisco
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW1

! Create VLANs
SW1(config)# vlan 10
SW1(config-vlan)# name Corporate
SW1(config-vlan)# exit

SW1(config)# vlan 20
SW1(config-vlan)# name Guest
SW1(config-vlan)# exit

SW1(config)# vlan 99
SW1(config-vlan)# name Management
SW1(config-vlan)# exit
```

#### Step 2: Configure Management Interface and Trunk
```cisco
! Configure management VLAN interface
SW1(config)# interface vlan 99
SW1(config-if)# ip address 10.1.99.10 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit

! Set default gateway
SW1(config)# ip default-gateway 10.1.99.1

! Configure trunk to router
SW1(config)# interface gig0/1
SW1(config-if)# description Trunk to Router
SW1(config-if)# switchport mode trunk
SW1(config-if)# switchport trunk allowed vlan 10,20,99
SW1(config-if)# exit

! Configure port to RADIUS server (Management VLAN)
SW1(config)# interface fa0/24
SW1(config-if)# description RADIUS Server
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 99
SW1(config-if)# spanning-tree portfast
SW1(config-if)# exit
```

#### Step 3: Configure Router for Inter-VLAN Routing
```cisco
Router> enable
Router# configure terminal
Router(config)# hostname R1

! Configure subinterfaces
R1(config)# interface gig0/0.10
R1(config-subif)# description Corporate VLAN
R1(config-subif)# encapsulation dot1Q 10
R1(config-subif)# ip address 10.1.10.1 255.255.255.0
R1(config-subif)# exit

R1(config)# interface gig0/0.20
R1(config-subif)# description Guest VLAN
R1(config-subif)# encapsulation dot1Q 20
R1(config-subif)# ip address 10.1.20.1 255.255.255.0
R1(config-subif)# exit

R1(config)# interface gig0/0.99
R1(config-subif)# description Management VLAN
R1(config-subif)# encapsulation dot1Q 99
R1(config-subif)# ip address 10.1.99.1 255.255.255.0
R1(config-subif)# exit

! Enable physical interface
R1(config)# interface gig0/0
R1(config-if)# no shutdown
R1(config-if)# exit
```

---

### PHASE 2: RADIUS SERVER CONFIGURATION

#### Step 4: Configure RADIUS Server

**On RADIUS Server (Packet Tracer GUI):**

1. Click on Server ‚Üí Services ‚Üí AAA
2. Enable AAA Service
3. Add Network Configuration:
   - **Client Name:** SW1
   - **Client IP:** 10.1.99.10
   - **Secret Key:** Rad1us$ecr3t

4. Add User Accounts:

**Corporate User (Employee):**
- Username: `john.doe`
- Password: `C0rpor@te123`
- VLAN ID: `10`
- Service Type: `Login`

**Corporate User (IT Admin):**
- Username: `admin`
- Password: `Adm1n$ecure!`
- VLAN ID: `10`
- Service Type: `Administrative`

**Guest User (Optional - for testing):**
- Username: `guest`
- Password: `guest123`
- VLAN ID: `20`
- Service Type: `Login`

---

### PHASE 3: 802.1X CONFIGURATION ON SWITCH

#### Step 5: Enable AAA and 802.1X Globally
```cisco
! Enable AAA (Authentication, Authorization, Accounting)
SW1(config)# aaa new-model

! Define RADIUS server
SW1(config)# radius server RADIUS-SRV
SW1(config-radius-server)# address ipv4 10.1.99.50 auth-port 1645
SW1(config-radius-server)# key Rad1us$ecr3t
SW1(config-radius-server)# exit

! Create AAA authentication method list
SW1(config)# aaa authentication dot1x default group radius

! Enable 802.1X globally
SW1(config)# dot1x system-auth-control

! Enable VLAN assignment from RADIUS
SW1(config)# aaa authorization network default group radius
```

**What each command does:**
- **aaa new-model:** Enables AAA framework
- **radius server:** Defines RADIUS server IP and shared secret
- **aaa authentication:** Uses RADIUS for 802.1X authentication
- **dot1x system-auth-control:** Enables 802.1X globally
- **aaa authorization:** Allows RADIUS to assign VLANs dynamically

---

#### Step 6: Configure 802.1X on Access Ports
```cisco
! Configure Employee port (Fa0/1)
SW1(config)# interface fa0/1
SW1(config-if)# description Employee PC - 802.1X Enabled
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 10

! Enable 802.1X on this port
SW1(config-if)# authentication port-control auto

! Set authentication mode
SW1(config-if)# authentication periodic
SW1(config-if)# authentication timer reauthenticate 3600

! Configure Guest VLAN (for failed authentication)
SW1(config-if)# authentication event fail action authorize vlan 20

! Configure Auth-Fail VLAN (for no response)
SW1(config-if)# authentication event no-response action authorize vlan 20

! Enable periodic re-authentication (security)
SW1(config-if)# dot1x pae authenticator
SW1(config-if)# dot1x timeout tx-period 10
SW1(config-if)# exit
```

**Port Control Modes Explained:**
- **auto:** Port starts in unauthorized state, requires authentication
- **force-authorized:** Port always authorized (disables 802.1X)
- **force-unauthorized:** Port always blocked

**Guest VLAN Logic:**
- **Authentication fails:** User placed in VLAN 20 (Guest)
- **No response:** Device doesn't support 802.1X ‚Üí VLAN 20
- **Authentication succeeds:** RADIUS assigns VLAN (typically VLAN 10)

---

#### Step 7: Configure Additional Ports (Guest and Test Ports)
```cisco
! Configure Guest port (Fa0/2) - Same as Fa0/1
SW1(config)# interface fa0/2
SW1(config-if)# description Guest PC - 802.1X Enabled
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 10
SW1(config-if)# authentication port-control auto
SW1(config-if)# authentication event fail action authorize vlan 20
SW1(config-if)# authentication event no-response action authorize vlan 20
SW1(config-if)# dot1x pae authenticator
SW1(config-if)# exit

! Configure Unauthorized port (Fa0/3) - For testing denial
SW1(config)# interface fa0/3
SW1(config-if)# description Unauthorized PC - 802.1X Enabled
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 10
SW1(config-if)# authentication port-control auto
SW1(config-if)# authentication event fail action authorize vlan 20
SW1(config-if)# dot1x pae authenticator
SW1(config-if)# exit
```

---

#### Step 8: Configure MAB (MAC Authentication Bypass) - Optional

**For devices that don't support 802.1X (printers, IP phones):**
```cisco
! Configure MAB on printer port (Fa0/10)
SW1(config)# interface fa0/10
SW1(config-if)# description Network Printer - MAB Enabled
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 10
SW1(config-if)# authentication port-control auto
SW1(config-if)# authentication fallback mab
SW1(config-if)# mab
SW1(config-if)# exit
```

**On RADIUS Server, add MAC address:**
- Username: `0050.0f12.3456` (printer MAC)
- Password: `0050.0f12.3456` (same as username)
- VLAN: `10`

---

### PHASE 4: CLIENT CONFIGURATION

#### Step 9: Configure 802.1X on Employee PC (Windows)

**Note:** In Packet Tracer, this is simulated. In real networks:

**Windows Client Configuration:**
1. Control Panel ‚Üí Network Connections
2. Right-click adapter ‚Üí Properties
3. Authentication tab
4. Enable IEEE 802.1X authentication
5. Select method: **Microsoft: Protected EAP (PEAP)**
6. Enter credentials:
   - Username: `john.doe`
   - Password: `C0rpor@te123`

**In Packet Tracer:**
- PC ‚Üí Desktop ‚Üí PC Wireless
- WPA2 Enterprise settings
- Username: `john.doe`
- Password: `C0rpor@te123`

---

## ‚úÖ Testing & Verification

### Test 1: Successful Authentication (Employee)

**Scenario:** Employee PC connects with valid credentials

**On Employee PC:**
```
C:\> ipconfig

IP Address: 10.1.10.10
Subnet Mask: 255.255.255.0
Default Gateway: 10.1.10.1

‚úÖ SUCCESS - Assigned to Corporate VLAN (10)
```

**Verify on Switch:**
```cisco
SW1# show authentication sessions interface fa0/1

Interface:  FastEthernet0/1
MAC Address:  0001.9641.2D01
Status:       Authorized
Domain:       DATA
Security Policy: Should Secure
Security Status: Unsecure
Oper host mode:  single-host
Oper control dir: both
Authorized By:    Authentication Server
Vlan Policy:      10
```

**Key Information:**
- **Status: Authorized** - Authentication successful
- **Authorized By: Authentication Server** - RADIUS approved
- **Vlan Policy: 10** - Placed in Corporate VLAN

‚úÖ **Employee authenticated and assigned to correct VLAN!**

---

### Test 2: Failed Authentication (Wrong Password)

**Scenario:** Guest PC tries to authenticate with invalid credentials

**On Guest PC:**
- Username: `john.doe`
- Password: `WrongPassword123`

**Result:**
```
C:\> ipconfig

IP Address: 10.1.20.10
Subnet Mask: 255.255.255.0
Default Gateway: 10.1.20.1

‚úÖ SUCCESS - Placed in Guest VLAN (20) due to auth failure
```

**Verify on Switch:**
```cisco
SW1# show authentication sessions interface fa0/2

Interface:  FastEthernet0/2
MAC Address:  0002.1234.5678
Status:       Authorized
Authorized By:    Guest Vlan
Vlan Policy:      20
```

**Key Information:**
- **Authorized By: Guest Vlan** - Failed auth, fallback to guest
- **Vlan Policy: 20** - Guest VLAN assignment

‚úÖ **Failed authentication handled correctly - guest access granted!**

---

### Test 3: No 802.1X Support (Legacy Device)

**Scenario:** Printer or legacy device without 802.1X support

**On Switch:**
```cisco
SW1# show authentication sessions interface fa0/3

Interface:  FastEthernet0/3
MAC Address:  0003.ABCD.EF01
Status:       Authorized
Authorized By:    Guest Vlan
Vlan Policy:      20
```

**Result:** Device placed in Guest VLAN (no 802.1X response)

‚úÖ **Non-802.1X devices automatically get guest access!**

---

### Test 4: RADIUS Server Communication

**Verify RADIUS server reachability:**
```cisco
SW1# ping 10.1.99.50

!!!!!
Success rate is 100 percent (5/5)
```

**Test RADIUS authentication:**
```cisco
SW1# test aaa group radius john.doe C0rpor@te123 legacy

Attempting authentication test to server-group radius using radius
User was successfully authenticated.
```

‚úÖ **RADIUS communication working!**

---

### Test 5: Dynamic VLAN Assignment

**Verify RADIUS is assigning VLANs:**

**Before authentication:**
```cisco
SW1# show vlan brief | include Fa0/1
10   Corporate    active    
```

**After authentication:**
```cisco
SW1# show vlan brief | include Fa0/1
10   Corporate    active    Fa0/1

SW1# show authentication sessions interface fa0/1 | include Vlan
Vlan Policy:      10
```

‚úÖ **Dynamic VLAN assignment from RADIUS working!**

---

### Test 6: Re-authentication Testing

**Force re-authentication after 60 minutes:**
```cisco
SW1# show authentication sessions interface fa0/1
...
Timeout:          3600 seconds (Session)
Time Elapsed:     124 seconds
Time to Termination: 3476 seconds
```

**Manually trigger re-auth for testing:**
```cisco
SW1# dot1x re-authenticate interface fa0/1

! PC will be prompted to re-authenticate
```

‚úÖ **Periodic re-authentication working!**

---

### Test 7: Port Security + 802.1X (Layered Security)

**Combine 802.1X with port security:**
```cisco
SW1(config)# interface fa0/1
SW1(config-if)# switchport port-security
SW1(config-if)# switchport port-security maximum 1
SW1(config-if)# switchport port-security violation restrict
SW1(config-if)# exit
```

**Test:** Try connecting second device after authentication

**Result:** Port security blocks second device even if authenticated

‚úÖ **Defense in depth: 802.1X + Port Security!**

---

## üêõ Troubleshooting Issues I Encountered

### Problem 1: Authentication always fails (RADIUS unreachable)

**Symptom:**
```
C:\> ipconfig
IP Address: 10.1.20.10 (Guest VLAN every time)
```

**Debugging:**
```cisco
SW1# debug dot1x all
SW1# debug radius authentication

! Shows: "RADIUS server not responding"
```

**Root Cause:** RADIUS server IP or shared secret mismatch

**Verification:**
```cisco
SW1# show radius server-group all
Server group radius
    Server: 10.1.99.50 on auth-port 1645

SW1# show run | include radius
radius server RADIUS-SRV
 address ipv4 10.1.99.50 auth-port 1645
 key 7 08314D5D1A0E1C40  (encrypted key)
```

**Check on RADIUS server:**
- Client IP: Must be 10.1.99.10 (switch IP)
- Shared Secret: Must match `Rad1us$ecr3t`

**Solution:**
```cisco
SW1(config)# no radius server RADIUS-SRV
SW1(config)# radius server RADIUS-SRV
SW1(config-radius-server)# address ipv4 10.1.99.50 auth-port 1645
SW1(config-radius-server)# key Rad1us$ecr3t
```

**Lesson Learned:** RADIUS shared secret is case-sensitive and must match exactly!

---

### Problem 2: Authenticated users placed in wrong VLAN

**Symptom:** User authenticates successfully but stays in default VLAN 1

**Debugging:**
```cisco
SW1# show authentication sessions interface fa0/1
Vlan Policy:      N/A
```

**Root Cause:** AAA authorization not configured for VLAN assignment

**Solution:**
```cisco
SW1(config)# aaa authorization network default group radius
```

**On RADIUS server, verify VLAN attribute:**
- User: john.doe
- VLAN ID: **10** (must be configured!)

**Lesson Learned:** Authorization must be enabled separately from authentication!

---

### Problem 3: Guest VLAN not working (no fallback)

**Symptom:** Non-802.1X devices get no network access (port stays blocked)

**Debugging:**
```cisco
SW1# show authentication sessions interface fa0/3
Status: Unauthorized
```

**Root Cause:** Guest VLAN not configured on port

**Solution:**
```cisco
SW1(config)# interface fa0/3
SW1(config-if)# authentication event fail action authorize vlan 20
SW1(config-if)# authentication event no-response action authorize vlan 20
```

**Test:**
```cisco
SW1# show authentication sessions interface fa0/3
Status:       Authorized
Authorized By:    Guest Vlan
Vlan Policy:      20
```

‚úÖ **Guest VLAN now working!**

**Lesson Learned:** Must explicitly configure fail and no-response actions!

---

### Problem 4: Authentication works but no network connectivity

**Symptom:**
```
C:\> ipconfig
IP Address: 169.254.x.x (APIPA address)

C:\> ping 10.1.10.1
Request timed out
```

**Debugging:**
```cisco
SW1# show authentication sessions interface fa0/1
Status:       Authorized
Vlan Policy:      10
```

**Root Cause:** DHCP not configured on router or DHCP relay missing

**Solution on Router:**
```cisco
R1(config)# ip dhcp excluded-address 10.1.10.1 10.1.10.9
R1(config)# ip dhcp pool CORPORATE
R1(dhcp-config)# network 10.1.10.0 255.255.255.0
R1(dhcp-config)# default-router 10.1.10.1
R1(dhcp-config)# dns-server 8.8.8.8
R1(dhcp-config)# exit

R1(config)# ip dhcp pool GUEST
R1(dhcp-config)# network 10.1.20.0 255.255.255.0
R1(dhcp-config)# default-router 10.1.20.1
R1(dhcp-config)# dns-server 8.8.8.8
```

**On PC, renew DHCP:**
```
C:\> ipconfig /release
C:\> ipconfig /renew

IP Address: 10.1.10.10
‚úÖ SUCCESS
```

**Lesson Learned:** 802.1X handles authentication, but DHCP still needed for IP assignment!

---

### Problem 5: Periodic re-authentication disrupts users

**Symptom:** Users get disconnected every hour when re-auth timer expires

**Root Cause:** Re-authentication configured too aggressively

**Current config:**
```cisco
SW1# show authentication sessions interface fa0/1
Timeout:          3600 seconds
```

**Solution:** Increase re-auth timer or make it less disruptive:
```cisco
SW1(config)# interface range fa0/1-10
SW1(config-if-range)# authentication timer reauthenticate server

! Or disable periodic re-auth (less secure)
SW1(config-if-range)# no authentication periodic
```

**Better approach:** Use RADIUS session timeout instead:

**On RADIUS server:**
- Session-Timeout: 86400 (24 hours instead of 1 hour)

**Lesson Learned:** Balance security (frequent re-auth) with user experience!

---

## üìù Key Takeaways

### 802.1X Concepts Mastered

‚úÖ **Port-Based Access Control:** Authentication required before network access

‚úÖ **Three Roles:**
- **Supplicant:** Client device (PC, laptop)
- **Authenticator:** Network switch (enforces policy)
- **Authentication Server:** RADIUS (validates credentials)

‚úÖ **EAP (Extensible Authentication Protocol):**
- EAPOL: Communication between supplicant and authenticator
- RADIUS: Communication between authenticator and auth server

‚úÖ **Dynamic VLAN Assignment:**
- RADIUS assigns VLAN based on user identity
- Different users on same port can get different VLANs

‚úÖ **Guest VLAN Fallback:**
- Non-802.1X devices automatically placed in restricted VLAN
- Prevents network denial while maintaining security

### Security Benefits

| Benefit | Implementation |
|---------|----------------|
| **Identity-Based Access** | Only authenticated users access network |
| **Dynamic Segmentation** | VLAN assigned based on user role |
| **Centralized Management** | Single RADIUS server for all switches |
| **Guest Isolation** | Unauthenticated devices restricted to guest network |
| **Compliance** | Audit trail of who accessed network when |

### Technical Skills Showcased

- AAA framework configuration
- RADIUS server integration
- 802.1X protocol understanding
- Dynamic VLAN assignment
- MAB (MAC Authentication Bypass)
- Guest VLAN implementation
- Multi-layered security (802.1X + Port Security)
- Enterprise authentication troubleshooting

### Real-World Applications

**Use Cases:**
- **Corporate Networks:** Enforce authentication for all wired connections
- **BYOD Environments:** Different access for corporate vs. personal devices
- **Healthcare (HIPAA):** Audit who accessed patient data networks
- **Education:** Student vs. faculty network access
- **Compliance:** PCI-DSS requires network access control

**Deployment Scenarios:**
- **802.1X + Active Directory:** Use AD credentials for network auth
- **802.1X + Certificates:** Certificate-based authentication (no passwords)
- **802.1X + MFA:** Combine with two-factor authentication
- **Wireless 802.1X:** WPA2-Enterprise (same concept, wireless)

---

## üîó Related Concepts

### What I Learned

**EAP Methods:**
- **EAP-TLS:** Certificate-based (most secure)
- **PEAP-MSCHAPv2:** Password-based (common in Windows)
- **EAP-FAST:** Cisco proprietary (easy deployment)
- **EAP-TTLS:** Flexible authentication

**Advanced 802.1X Features:**
- **Multi-Domain Authentication:** IP phone + PC on same port
- **Flexible Authentication:** Multiple auth methods per port
- **Wake-on-LAN with 802.1X:** Allow WOL packets before auth
- **Downloadable ACLs:** RADIUS pushes ACLs to switch dynamically

**Integration Points:**
- **Active Directory:** RADIUS uses AD for user database
- **Certificate Authority:** Issue certificates for EAP-TLS
- **SIEM Systems:** Log authentication events for security monitoring
- **NAC Solutions:** Cisco ISE, Aruba ClearPass (advanced 802.1X)

### Skills to Build Next

1. **Cisco ISE (Identity Services Engine)** - Enterprise NAC platform
2. **Certificate-Based 802.1X** - PKI integration
3. **Wireless 802.1X (WPA2-Enterprise)** - Apply to WiFi
4. **Profiling & Posture Assessment** - Check device compliance
5. **Multi-Factor Authentication** - Integrate with Duo, Okta

### Career Relevance

**Roles This Prepares You For:**
- Network Security Engineer
- Identity & Access Management (IAM) Engineer
- Network Administrator
- Security Operations Center (SOC) Analyst
- Compliance Engineer

**Interview Questions Answered:**
- "How do you prevent unauthorized devices from accessing the network?"
- "Explain 802.1X authentication flow."
- "What's the difference between 802.1X and port security?"
- "How would you handle devices that don't support 802.1X?"
- "How do you troubleshoot authentication failures?"

---

## üîó Related Labs

- [Lab 1: Secure VLAN Design with ACLs](../vlan/lab01-secure-vlan-acl.md) - Foundation
- [Lab 2: Site-to-Site VPN with IPsec](../vpn/lab02-site-to-site-vpn.md) - Previous
- [Lab 4: OSPF Multi-Area Design](../routing/lab04-ospf-multi-area.md) - Next
- [Lab 5: High Availability with HSRP](../redundancy/lab05-hsrp.md)

---

## üìö Resources & References

**Cisco Documentation:**
- [802.1X Configuration Guide](https://www.cisco.com/c/en/us/td/docs/switches/lan/catalyst2960/software/release/12-2_55_se/configuration/guide/scg_2960/swauthen.html)
- [AAA and RADIUS Configuration](https://www.cisco.com/c/en/us/support/docs/security-vpn/remote-authentication-dial-user-service-radius/13838-10.html)

**Standards:**
- IEEE 802.1X-2010 (Port-Based Network Access Control)
- RFC 2865 (RADIUS Authentication)
- RFC 3748 (EAP)

**Tools:**
- FreeRADIUS (open-source RADIUS server)
- Cisco Identity Services Engine (ISE)
- Windows NPS (Network Policy Server)

---

**Lab Completed:** February 2026  
**Source:** Custom lab based on CCNA Security + enterprise best practices  
**Time Spent:** 3.5 hours (including RADIUS setup and client testing)  
**Difficulty:** Intermediate-Advanced  
**Prerequisites:** VLANs, AAA concepts, basic security understanding

---

**üí° Why This Lab Matters for Your Career:**

802.1X is **THE** enterprise standard for network access control. When you interview:
- "I implemented 802.1X with RADIUS for 500+ employees"
- "Reduced unauthorized network access by 100% using port-based authentication"
- "Integrated with Active Directory for centralized authentication"

This separates you from candidates who only know basic port security!
